{
  "Tomato Mosaic Virus": [
    {
      "Causes": "Tomato mosaic virus symptoms can be found at any stage of growth and all parts of the plant may be infected. ToMV causes yellow mosaic symptoms on the leaves and tomato fruits. Tomato mosaic virus symptoms are seen as a general mottling or mosaic appearance on foliage. Light and darker green mosaic leaf mottle, sometimes with distortion of younger leaves; this is the most common reaction in summer in glasshouses."
    },
    {
      "Remedies": "The only treatment is prevention. No chemical products are available to cure or protect plants. The best factor in controlling and reducing infection is to practice sanitation. Remove any infected plants, including the roots. Remove Also, discard any plants near those affected."
    }
  ],
  "Tomato Target Spot": [
    {
      "Causes": "Symptoms appear on all aboveground parts of the plant. Foliar lesions begin as small, pinpoint, water-soaked spots on the upper surface. Gradually these increase in size (up to 2 cm diameter), becoming circular, frequently ringed, and pale brown with conspicuous yellow halos. The lesions will coalesce leading to blighting of foliage. The subsequent premature defoliation affects fruit quality and yield."
    },
    {
      "Remedies": "Spray with protectant fungicides after first symptoms appear. Consult with your local extension agent for fungicides available in your region. Remove affected debris to prevent carryover into the next crop. Use an adequate period of crop rotation. Genetic resistance to this fungus has been documented in tomato and soybean but commercial varieties are not yet available."
    }
  ],
  "Tomato yellow leaf curl virus": [
    {
      "Causes":"Tomato yellow leaf curl virus (TYLCV) is a DNA virus from the genus Begomovirus and the family Geminiviridae. TYLCV causes the most destructive disease of tomato, and it can be found in tropical and subtropical regions causing severe economic losses. This virus is transmitted by an insect vector from the family Aleyrodidae and order Hemiptera, the whitefly Bemisia tabaci, commonly known as the silverleaf whitefly or the sweet potato whitefly."
    },
    {
      "Remedies":"Currently, the most effective treatments used to control the spread of TYLCV are insecticides and resistant crop varieties. The effectiveness of insecticides is not optimal in tropical areas due to whitefly resistance against the insecticides; therefore, insecticides should be alternated or mixed to provide the most effective treatment against virus transmission.[6] Developing countries experience the most significant losses due to TYLCV infections due to the warm climate as well as the expensive costs of insecticides used as the control strategy. Other methods to control the spread of TYLCV include planting resistant/tolerant lines, crop rotation, and breeding for resistance of TYLCV. As with many other plant viruses, one of the most promising methods to control TYLCV is the production of transgenic tomato plants resistant to TYLCV."
    }
  ],
  "Tomato Bacterial Spot": [
    {
      "Causes": "This disease is a result of the bacteria xanthomonas campestris pv. vesicatoria, which can exist on tomato seeds as well as on specific weeds. Bacterial spot can be spread through rain, irrigation, or wet plants. Tomato plants can be infected through pores and wounds, especially in warm, moist weather."
    },
    {
      "Remedies":
      "Buy certified disease-free tomato seeds and use sterilized soil or a mix that is commercially rendered. Submerge seeds for one minute in 1.3% sodium hypochlorite. Submerge the seeds in 122-degree Fahrenheit water for 25 minutes. Ensure that the tomato plants do not receive too much water, as moist conditions attract the spot-causing bacteria. Copper fungicides for tomatoes will deny the growth of bacterial spot for two to four weeks. Copper sprays are best applied before any signs of disease are present, since this will enable them to better control it. These types of sprays should be used before and after rain, but not during. If spots are discovered, spray plants for 7 to 10 days, and for one day before transplanting them. Once in the field, spotted plants should be sprayed one week after being planted, every 5 to 7 days when the weather is rainy, and every 10 days when the weather is drier."
    }
  ],
  "Tomato Early Blight": [
    {
      "Causes": "Early Blight is a fungal infection that can occur for many different reasons. Nutrient-deficient soil, including a lack of lime, can create a breeding ground for this disease. The fungus can also be bred by heavy rainfall, mixed with humidity and certain soil conditions. No matter what the cause, blight can be detrimental to your crop."
    },
    {
      "Remedies": "Fungicides are the most common solution used to effectively treat and control early blight and must be re-applied every 7-10 days to account for weathering and to protect new plant growth. Use multiple fungicides on a scheduled spray schedule. Make absolutely certain to heed the usage recommendations on the label of all products that you use."
    }
  ],
  "Tomato Late Blight": [
    {
      "Causes": "Late blight (Phytophthora infestans) is a fungus-like microorganism that is usually brought into the garden by the introduction of infected tomato seedlings or seed potatoes or by infected volunteer plants from the previous year’s garden. The fungus is also spread atmospherically when the live spores are blown in during periods of rain and wind. Optimum conditions for the rapid spread of the disease occurs during episodes of moderate temperatures and high moisture."
    },
    {
      "Remedies": "The first line of attack against late blight is for immediate removal and destruction of any infected plants. The plants should then be either burned or bagged and discarded through normal garbage disposal means. Infected plants should never be placed in the compost pile as this will certainly spread the disease. Staking tomatoes and using a system of drip irrigation will reduce the potential for leaf dampness, as will allowing enough space between plants for adequate air circulation. Mulching the area around the plants is also beneficial. In addition, you can plant tomato disease-resistant varieties that are specified as blight resistant. If the infestation is not too widespread and perhaps only affecting a few plants, removing and destroying the infected plants and treating the remaining healthy ones with a fungicide spray for tomatoes may salvage some of the crops. Tomato fungicides containing copper are often recommended for the gardener wishing to avoid harsh chemicals. Any fungicide treatments applied are likely to be successful only if the plant or plants are not showing any signs of late blight infestation. Frequent and regular applications are generally recommended with particular attention being made to spray the plants after each rainfall. It is important the gardener rotate their tomato plantings and not plant tomatoes in the same spot every year, perhaps leaving two to three years between planting tomatoes in the same location."
    }
  ],
  "Tomato Leaf Mold": [
    {
      "Causes": "With this type of fungus, it is rare that the fruit is infected as well. The signs to look for are all on the leaves. The tops will begin to develop small, white, gray, yellow, or pale green patches. The underside of the leave will have a fuzzy feeling that is purple in color. Sometimes the fuzz will be olive green. The “fuzz” is actually spores of the fungus."
    },
    {
      "Remedies": "When you notice the infected areas, the first thing you can do is let the plants air out. If they are being grown in a greenhouse, air exposure is a must, because the humidity that the fungus needs to survive is dried up. Try to keep from wetting the leaves when you are watering the plants. When you water the plants, earlier watering is optimal because it allows the plant time to dry when the sun comes, keeping the humidity around leaves to a minimum. Another option for treatment is fungacide sprays. When using these sprays, be sure to cover each part of the plant that is above ground, paying special attention to the underside of the leaf. Some of the most widely recommended sprays are those containing calcium chloride. There are some organic fungicides available as well. Some remedies that can be mixed up right in your kitchen include an apple-cider and vinegar mix to treat the mold. Corn and garlic spray can be used to prevent the fungi outbreaks before they even occur. A milk spray is also a natural, helpful cure."
    }
  ],
  "Tomato Septoria Leaf Spot": [
    {
      "Causes": "Septoria leaf spot is caused by septoria lycopersici, a fungus that lives in the soil near tomato plants or on weeds that can grow in gardens. The fungus creates spores that are carried by wind and rain to uninfected plants. The fungus causes deterioration of the plant foliage."
    },
    {
      "Remedies": "Engage in what is known as clean cultivation, in which you inspect your plants and remove the sick and dead ones from your garden. It is preferable, when these plants are removed, that you use them to make compost so that nutrients are put back into the soil. Tomato fungicides are another option for treatment. These should be mixed with water and sprayed all over the plants in the morning and before and after it rains. You can also buy ready-made fungicide sprays for tomatoes and use them in the same way. These products are best used before disease sets in but are also useful after the first signs of disease. Many of the best fungicide products contain copper, which is extremely toxic to the fungus and rapidly kills it. Once treatment has been applied, it is imperative to control the spread of the disease and prevent any recurrences. Here are steps you can take when caring for your tomato plants. Use a control method to keep weeds at bay. Since septoria lycopersici is found on horse nettle and jimsonweed, keep your garden free of these. For preventative purposes, try to plant your tomatoes early in the season, since the fungus is less likely to thrive in colder temperatures, or you can try rotating your plants so that you only plant tomatoes in one spot in your garden once every few years. Mulching can be used as an effective preventative as well since it is a way to keep potentially infected soil from coming into contact with your plants. You should not handle your tomato plants when they are wet, and be careful not to water them too much, as too much moisture invites fungus. Watering your tomato plants every few days, as opposed to every day, will provide them adequate moisture and discourage fungus infestation."
    }
  ],
  "Tomato Spider mites Two-spotted spider mite": [
    {
      "Causes": "Two-spotted spider mites are occasional pests that can cause serious damage to some vegetable crops during hot dry weather. Mites can injure tomatoes, beans, muskmelons, watermelons, and sweet corn. Extended periods of hot, dry weather favors mite buildups. Infestations usually first occur at the edge of a field, typically near rank weed growth or dirt roads."
    },
    {
      "Remedies": "Natural enemies of mites are present in and around fields and can keep mite populations low. Many insecticides used for control of insect pests severely reduce numbers of beneficial insects that keep mite populations in check. Therefore, apply insecticides only as-needed, rather than at regularly scheduled intervals. When possible, select pesticides that will have the least impact on beneficial insects. Destruction of weeds adjacent to and in fields should be done in the fall or early spring. Growers should manage weeds around fields carefully during the season. Grass should be mowed regularly. Spraying or mowing of weeds after growth has become rank may increase the movement of mites to cultivated plants. Use of overhead-sprinkler irrigation may provide some short- term relief of mite infestations. Miticides are available for some vegetable crops but should be used only where justified. As with aphids, mark infestations with flags, and check them again every 3 or 4 days. Mites can easily be moved to infested plants on clothing, so always examine infested areas last during inspections. If the infestation is not spreading, treatment will not be required. Because mite populations often are localized, spot spraying may be effective. If you spray only a portion of the field, spray a buffer zone of 100 to 200 feet beyond the mite-infested area. Resistance to pesticides has increased the difficulty of controlling these pests. Because mites primarily occur on the undersides of leaves, applications of contact miticides need to be directed at both the lower and upper leaf surfaces. Mite eggs are resistant to some miticides, so repeated applications are often necessary to control infestations. Two applications spaced 5 to 7 days apart may be necessary."
    }
  ],
  "Healthy": [
    {
      "Causes": "N/A"
    },
    {
      "Remedies": "N/A"
    }
  ]
}
